export default async function PostsPage() {
	return (
		<div style={{ width: '800px', textAlign: 'center', margin: '20px auto 20px' }}>
			<div style={{ display: 'flex', flexDirection: 'column', gap: '10px', margin: '0 auto', width: '600px' }}></div>
			<h3 style={{ textAlign: 'center', fontSize: '20px', marginBottom: '10px' }}>Посты</h3>
			<ul>
				<li style={{ marginBottom: '30px' }}>
					Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности в
					значительной степени обуславливает создание соответствующий условий активизации. Равным образом постоянный
					количественный рост и сфера нашей активности способствует подготовки и реализации новых предложений. Таким
					образом сложившаяся структура организации влечет за собой процесс внедрения и модернизации систем массового
					участия. Товарищи! укрепление и развитие структуры представляет собой интересный эксперимент проверки
					существенных финансовых и административных условий.
				</li>
				<li style={{ marginBottom: '30px' }}>
					Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности представляет собой
					интересный эксперимент проверки форм развития. Не следует, однако забывать, что постоянное
					информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов)
					участие в формировании модели развития. С другой стороны сложившаяся структура организации способствует
					подготовки и реализации новых предложений. Повседневная практика показывает, что реализация намеченных
					плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании систем массового участия.
				</li>
				<li style={{ marginBottom: '30px' }}>
					С другой стороны укрепление и развитие структуры представляет собой интересный эксперимент проверки системы
					обучения кадров, соответствует насущным потребностям. Повседневная практика показывает, что укрепление и
					развитие структуры представляет собой интересный эксперимент проверки системы обучения кадров, соответствует
					насущным потребностям. Значимость этих проблем настолько очевидна, что консультация с широким активом
					способствует подготовки и реализации дальнейших направлений развития.
				</li>
			</ul>
		</div>
	);
}
