import { ExampleForm, TestEntity, TestEntity2, TestEntity3 } from '../../entities';
// import { Container, Col, Row } from '../../shared/ui/';

export default function AboutPage() {
	return (
		<div style={{ width: '1000px', margin: '0 auto' }}>
			<h3 style={{ textAlign: 'center', fontSize: '30px' }}>О нас</h3>
			<TestEntity />
			<TestEntity2 />
			<TestEntity3 />
			<ExampleForm />
			<div style={{ width: '900px', textAlign: 'center', margin: '0 auto' }}>
				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>

				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>

				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>

				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>

				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>

				<p className="paragraph">
					Сложно сказать, почему ключевые особенности структуры проекта будут своевременно верифицированы. С учётом
					сложившейся международной обстановки, экономическая повестка сегодняшнего дня играет важную роль в
					формировании первоочередных требований. Также как сплочённость команды профессионалов предполагает независимые
					способы реализации позиций, занимаемых участниками в отношении поставленных задач! Следует отметить, что
					перспективное планирование обеспечивает широкому кругу (специалистов) участие в формировании системы массового
					участия. В целом, конечно, реализация намеченных плановых заданий не оставляет шанса для кластеризации усилий.
					Наше дело не так однозначно, как может показаться: дальнейшее развитие различных форм деятельности является
					качественно новой ступенью соответствующих условий активизации. Картельные сговоры не допускают ситуации, при
					которой действия представителей оппозиции функционально разнесены на независимые элементы.
				</p>
			</div>

			{/*<Container>*/}
			{/*	<Row>*/}
			{/*		<Col cn={{ cols: 'col-6' }}>Col</Col>*/}
			{/*		<Col cn={{ cols: 'col-6' }}>Col</Col>*/}
			{/*	</Row>*/}
			{/*	<Row>*/}
			{/*		<Col cn={{ cols: 'col-6' }}>Col</Col>*/}
			{/*		<Col cn={{ cols: 'col-6' }}>Col</Col>*/}
			{/*	</Row>*/}
			{/*</Container>*/}
		</div>
	);
}
